param_bounds = {'x1' : (-1, 5), # 딕셔너리 형태
                'x2' : (0,4)}

def eval_function(x1, x2):
    return -x1 **2 - (x2 -2) **2 + 10 # 최대값

from bayes_opt import BayesianOptimization # pip install bayesian_Optimization

optimizer = BayesianOptimization(f=eval_function,      # 파라미터를 찾고싶은 함수 : model에 평가 지표로 나온 값?
                                 pbounds=param_bounds, # 그 함수의 들어가는 파라미터를 딕셔너리 형태로 넣는다
                                 random_state=1234)
optimizer.maximize(init_points=2,# init_points=초기치를 잡아주는 것       # maximize - 가장높은것, 
                   n_iter=20    # 20번 돌릴꺼다
                   ) 

print(optimizer.max) # {'target': 9.999835918969607, 'params': {'x1': 0.00783279093916099, 'x2': 1.9898644972252864}}













# |   iter    |  target   |    x1     |    x2     |
# -------------------------------------------------
# |  1        |  9.739    |  0.1491   |  2.488    |
# |  2        |  6.052    |  1.626    |  3.141    | ----- 여기까지 초기값 돌린것
# |  3        |  6.528    |  1.775    |  1.435    |
# |  4        |  9.741    |  0.1599   |  2.483    |
# |  5        |  9.445    | -0.4807   |  1.431    |
# |  6        |  5.0      | -1.0      |  0.0      |
# |  7        |  5.0      | -1.0      |  4.0      |
# |  8        |  8.979    | -1.0      |  2.144    |
# |  9        | -19.0     |  5.0      |  0.0      |
# |  10       | -19.0     |  5.0      |  4.0      |
# |  11       |  5.355    |  0.8034   |  0.0      |
# |  12       |  9.63     |  0.5211   |  1.686    |
# |  13       |  9.98     | -0.1395   |  1.992    |
# |  14       |  9.923    |  0.2629   |  2.086    |
# |  15       |  9.966    |  0.02993  |  1.817    |
# |  16       |  9.996    |  0.01324  |  2.062    |
# |  17       |  10.0     |  0.01454  |  1.991    |
# |  18       |  10.0     |  0.007833 |  1.99     |
# |  19       |  10.0     |  0.002898 |  1.987    |
# |  20       |  9.996    | -0.01311  |  2.064    |
# |  21       |  9.998    | -0.02176  |  1.963    |
# |  22       |  9.999    |  0.01782  |  1.985    |
# =================================================